<?php

if (!function_exists('getBasketConfig')) {
    function getBasketConfig()
    {
        return [
            'services' => ['прокат' => 100, 'продажа' => 500, 'лизинг' => 2100],
            'additionalOptions' => ['кожаный салон' => 50, 'подогрев сидений' => 30, 'люк' => 100],
            'cars' => [
                'прокат' => ['Peugeot' => 200, 'Lada Priora' => 100, 'Nissan' => 300],
                'продажа' => ['Citroen' => 500, 'Skoda' => 300, 'Lexus' => 800],
                'лизинг' => ['Kia' => 50, 'Honda' => 100, 'Mazda' => 80],
            ],
            'preparation' => [
                'прокат' => ['бензин' => 50, 'шины' => 100, 'омыватель' => 200],
                'продажа' => ['полировка' => 100, 'чистка салона' => 50, 'ТО' => 200],
                'лизинг' => ['бензин' => 50, 'чистка салона' => 200, 'чистка двигателя' => 100],
            ],
            'prep_keys' => ['prep0', 'prep1', 'prep2'],
        ];
    }
}

